# Import Mysql

In [1]:
import mysql.connector as mydb

# Connect to database

In [2]:
conn = mydb.connect(host = "localhost",user = "root",password="")
print(conn)
conn.close()

<mysql.connector.connection.MySQLConnection object at 0x00000184B6C0D790>

# Create Database

In [3]:
conn = mydb.connect(host = "localhost",user = "root",password="")
cursor = conn.cursor()
cursor.execute(
    """CREATE DATABASE university"""
)
conn.commit()

# Show Database

In [4]:
conn = mydb.connect(host = "localhost",user = "root",password="")
cursor = conn.cursor()
cursor.execute(
    """SHOW DATABASES"""
)
for i in cursor:
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('test',)
('university',)

# Drop Database

In [5]:
# conn = mydb.connect(host = "localhost",user = "root",password="")
# cursor = conn.cursor()
# cursor.execute(
#     """DROP DATABASE university"""
# )
# conn.commit()

# Create Table

In [6]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """CREATE TABLE student(roll INT PRIMARY KEY,name CHAR(25),age INT,city VARCHAR(30))"""
)
conn.commit()

# Show Table

In [7]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute("""SHOW TABLES""")

for i in cursor:
    print(i)

('student',)

# Drop Table

In [8]:
# conn = mydb.connect(host = "localhost",user = "root",password="",database = "university")
# cursor = conn.cursor()
# cursor.execute(
#     """DROP TABLE student"""
# )
# conn.commit()

# Add Rows or Insert data

In [9]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """INSERT INTO student(roll,name,age,city) VALUES(%s,%s,%s,%s)""",(101,"Raihan Sikdar",25,"Dhaka")
)
conn.commit()

In [10]:
user = [
         (102, 'John Smith', 27, "Khulna"),
          (103, "Alexa Jones", 23, "Chittagong"),
          (104, "Alley P", 26,"Feni"),
          (105, "John S", 27,"Dhaka"),
          (106, "Babar Azam", 30,"Faridpur" ),
          (107, "Afridi", 29,"Gajipur"),
          (108, "Nasir", 24,"Dhaka"),
]
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.executemany(
    """INSERT INTO student(roll,name,age,city) VALUES(%s,%s,%s,%s)""",user
)
conn.commit()

# Select info

In [11]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 25, 'Dhaka')
(102, 'John Smith', 27, 'Khulna')
(103, 'Alexa Jones', 23, 'Chittagong')
(104, 'Alley P', 26, 'Feni')
(105, 'John S', 27, 'Dhaka')
(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')
(108, 'Nasir', 24, 'Dhaka')

# Updating Rows

In [12]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """UPDATE student SET roll = %s, name = %s,age = %s,city = %s WHERE roll=%s""",
    (115,'AL Mamun',25,"London",105)
)
conn.commit()

In [13]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 25, 'Dhaka')
(102, 'John Smith', 27, 'Khulna')
(103, 'Alexa Jones', 23, 'Chittagong')
(104, 'Alley P', 26, 'Feni')
(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')
(108, 'Nasir', 24, 'Dhaka')
(115, 'AL Mamun', 25, 'London')

In [14]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """UPDATE student SET age = %s WHERE roll IN (%s,%s)""",
    (29,101,102)
)
conn.commit()

In [15]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 29, 'Dhaka')
(102, 'John Smith', 29, 'Khulna')
(103, 'Alexa Jones', 23, 'Chittagong')
(104, 'Alley P', 26, 'Feni')
(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')
(108, 'Nasir', 24, 'Dhaka')
(115, 'AL Mamun', 25, 'London')

# Deleting Rows

In [16]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """DELETE FROM student WHERE roll =%s""",(115,)
)
conn.commit()

In [17]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 29, 'Dhaka')
(102, 'John Smith', 29, 'Khulna')
(103, 'Alexa Jones', 23, 'Chittagong')
(104, 'Alley P', 26, 'Feni')
(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')
(108, 'Nasir', 24, 'Dhaka')

# Where Clause

In [18]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student WHERE age>%s""",(26,)
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 29, 'Dhaka')
(102, 'John Smith', 29, 'Khulna')
(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')

# AND , OR, NOT, IN

In [19]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT roll,name FROM student WHERE age>%s AND city=%s """,(23,"Dhaka",)
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar')
(108, 'Nasir')

In [20]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT roll,name FROM student WHERE city IN(%s) """,("Dhaka",)
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar')
(108, 'Nasir')

# Wild Cards with LIKE

In [21]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student WHERE name LIKE '_%r' """
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 29, 'Dhaka')
(108, 'Nasir', 24, 'Dhaka')

In [22]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student WHERE name LIKE '_a%_' """
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 29, 'Dhaka')
(106, 'Babar Azam', 30, 'Faridpur')
(108, 'Nasir', 24, 'Dhaka')

# Aggregate Function

In [23]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT MAX(age),MIN(age),AVG(age),SUM(age),COUNT(*) FROM student"""
)
for i in cursor:
    print(i)

(30, 23, Decimal('27.1429'), Decimal('190'), 7)

In [24]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT roll,name,age FROM student WHERE age > (SELECT AVG(age) FROM student)"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 29)
(102, 'John Smith', 29)
(106, 'Babar Azam', 30)
(107, 'Afridi', 29)

# GROUP BY

In [25]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT COUNT(*), age FROM student GROUP BY age"""
)
for i in cursor:
    print(i)

(1, 23)
(1, 24)
(1, 26)
(3, 29)
(1, 30)

# ORDER BY

In [26]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM student ORDER BY age DESC,roll DESC"""
)
for i in cursor:
    print(i)

(106, 'Babar Azam', 30, 'Faridpur')
(107, 'Afridi', 29, 'Gajipur')
(102, 'John Smith', 29, 'Khulna')
(101, 'Raihan Sikdar', 29, 'Dhaka')
(104, 'Alley P', 26, 'Feni')
(108, 'Nasir', 24, 'Dhaka')
(103, 'Alexa Jones', 23, 'Chittagong')

# Create Another Table

In [27]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """CREATE TABLE result(roll INT,dept VARCHAR(10),cgpa float)"""
)
conn.commit()

# Show tables

In [28]:
conn = mydb.connect(host="localhost",user="root",password="",database="university")
cursor = conn.cursor()
cursor.execute(
    """SHOW TABLES"""
)
for i in cursor:
    print(i)

('result',)
('student',)

# Insert Value

In [29]:
user = [
    (101,'CSE',3.80),
    (102,'CSE',3.85),
    (103,'ENG',3.92),
    (104,'EEE',3.75),
    (106,'EEE',3.65),
    (107,'MATH',3.90)
]

conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.executemany(
    """INSERT INTO result(roll,dept,cgpa) VALUES(%s,%s,%s)""",user
)
conn.commit()

# Shows Value

In [30]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT * FROM result"""
)
for i in cursor:
    print(i)

(101, 'CSE', 3.8)
(102, 'CSE', 3.85)
(103, 'ENG', 3.92)
(104, 'EEE', 3.75)
(106, 'EEE', 3.65)
(107, 'MATH', 3.9)

# Join Table

In [31]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT student.roll,name,dept,cgpa 
       FROM student,result 
       WHERE student.roll = result.roll"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

# Join Clause

In [32]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT student.roll,name,dept,cgpa 
       FROM student JOIN result 
       ON student.roll = result.roll"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

# Inner Join

In [33]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT student.roll,name,dept,cgpa 
       FROM student INNER JOIN result 
       ON student.roll = result.roll"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

# Left Join

In [34]:
conn = mydb.connect(host="localhost",user="root",password="",database = "university")
cursor = conn.cursor()
cursor.execute(
    """SELECT student.roll,name,dept,cgpa 
       FROM student LEFT JOIN result 
       ON student.roll = result.roll"""
)
for i in cursor:
    print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)
(108, 'Nasir', None, None)

In [35]:
# https://sqliteonline.com/